Repository: gilrazil/Numa-iOS-App
Catalog: App/Numa/Numa/*.lproj/Localizable.strings
Languages: he

source: Hello, world!
he: שלום, עולם!

# goal_selection_title
source: What's your goal?
he: מה המטרה שלך?

# goal_selection_subtitle
source: Choose your primary weight goal to get personalized meal analysis
he: בחר את מטרת המשקל העיקרית שלך כדי לקבל ניתוח מזון מותאם אישית

# goal_lose_weight
source: Lose Weight
he: ירידה במשקל

# goal_maintain_weight
source: Maintain Weight
he: שמירה על המשקל

# goal_gain_weight
source: Gain Weight
he: עלייה במשקל

# goal_lose_description
source: Reduce body weight gradually
he: הפחתת משקל הגוף בהדרגה

# goal_maintain_description
source: Keep current weight stable
he: שמירה על המשקל הנוכחי

# goal_gain_description
source: Increase body weight healthily
he: הגדלת משקל הגוף בצורה בריאה

# continue_button
source: Continue
he: המשך

# personal_info_title
source: Tell us about yourself
he: ספר לנו עליך

# personal_info_subtitle
source: This helps us provide accurate nutritional recommendations
he: זה עוזר לנו לספק המלצות תזונה מדויקות

# field_current_weight
source: Current Weight (kg)
he: משקל נוכחי (ק"ג)

# field_target_weight
source: Target Weight (kg)
he: משקל יעד (ק"ג)

# field_height
source: Height (cm)
he: גובה (ס"מ)

# field_age
source: Age
he: גיל

# field_gender
source: Gender
he: מין

# gender_male
source: Male
he: זכר

# gender_female
source: Female
he: נקבה

# placeholder_current_weight
source: Enter current weight
he: הכנס משקל נוכחי

# placeholder_target_weight
source: Enter target weight
he: הכנס משקל יעד

# placeholder_height
source: Enter your height
he: הכנס את הגובה שלך

# placeholder_age
source: Enter your age
he: הכנס את הגיל שלך

# activity_level_title
source: How active are you?
he: כמה אתה פעיל?

# activity_level_subtitle
source: This helps us calculate your daily calorie needs accurately
he: זה עוזר לנו לחשב את הצרכים הקלוריים היומיים שלך בדיוק

# activity_sedentary
source: Sedentary
he: יושבני

# activity_light
source: Light
he: קל

# activity_moderate
source: Moderate
he: בינוני

# activity_active
source: Active
he: פעיל

# activity_very_active
source: Very Active
he: פעיל מאוד

# activity_sedentary_description
source: Little or no exercise
he: מעט או ללא פעילות גופנית

# activity_light_description
source: Light exercise 1-3 days/week
he: פעילות קלה 1-3 ימים בשבוע

# activity_moderate_description
source: Moderate exercise 3-5 days/week
he: פעילות בינונית 3-5 ימים בשבוע

# activity_active_description
source: Hard exercise 6-7 days/week
he: פעילות קשה 6-7 ימים בשבוע

# activity_very_active_description
source: Physical job or intense training
he: עבודה פיזית או אימונים אינטנסיביים

# get_started_button
source: Get Started
he: בואו נתחיל

# app_name
source: Numa
he: נומא

source: Loading...
he: טוען...

source: Error
he: שגיאה

source: OK
he: אישור

source: Cancel
he: ביטול

source: Save
he: שמור

source: Delete
he: מחק

source: Edit
he: ערוך

source: Done
he: סיום

source: Health
he: בריאות

source: Profile
he: פרופיל

source: Settings
he: הגדרות

source: Medical Records
he: רישומים רפואיים

source: Appointments
he: תורים

source: Medications
he: תרופות

source: Symptoms
he: תסמינים

source: Dashboard
he: לוח בקרה

# saving_button
source: Saving...
he: שומר...

# completing_onboarding_button
source: Completing...
he: משלים...

# welcome_home_title
source: Welcome to Numa
he: ברוכים הבאים לנומה

# track_your_meals
source: Track your meals and reach your health goals
he: עקבו אחר הארוחות שלכם והגיעו ליעדי הבריאות

# capture_meal_title
source: Capture Your Meal
he: צלמו את הארוחה

# take_photo_button
source: Take a Photo
he: צלמו תמונה

# take_photo_subtitle
source: Use your camera to capture your meal
he: השתמשו במצלמה כדי לצלם את הארוחה

# choose_photo_button
source: Choose from Library
he: בחרו מהגלריה

# choose_photo_subtitle
source: Select a photo from your gallery
he: בחרו תמונה מהגלריה שלכם

# meal_analysis_title
source: Meal Analysis
he: ניתוח ארוחה

# meal_analysis_subtitle
source: We'll analyze your meal to provide nutritional insights
he: אנחנו ננתח את הארוחה שלכם כדי לספק תובנות תזונתיות

# meal_photo_captured
source: Your meal photo has been captured
he: תמונת הארוחה שלכם נשמרה

source: Preparing Analysis
he: מכין ניתוח

# analysis_coming_soon
source: Meal analysis features will be available in the next update. Stay tuned!
he: תכונות ניתוח הארוחות יהיו זמינות בעדכון הבא. הישארו מעודכנים!

source: Permission Required
he: נדרשת הרשאה

# camera_permission_message
source: Numa needs access to your camera to take photos of your meals. Please enable camera access in Settings.
he: נומה זקוקה לגישה למצלמה כדי לצלם את הארוחות שלכם. אנא אפשרו גישה למצלמה בהגדרות.

# photo_library_permission_message
source: Numa needs access to your photo library to select meal photos. Please enable photo access in Settings.
he: נומה זקוקה לגישה לגלריית התמונות כדי לבחור תמונות ארוחות. אנא אפשרו גישה לתמונות בהגדרות.

source: Open Settings
he: פתח הגדרות

# cancel_button
source: Cancel
he: ביטול

# start_analysis_button
source: Start Analysis
he: התחל ניתוח

source: Analyzing Meal...
he: מנתח ארוחה...

source: Analyzing Your Meal
he: מנתח את הארוחה שלכם

# this_may_take_moment
source: This may take a moment...
he: זה עלול לקחת רגע...

# tap_to_analyze
source: Tap to start analyzing your meal
he: לחצו כדי להתחיל לנתח את הארוחה

source: Analysis Complete
he: הניתוח הושלם

source: Confidence Level
he: רמת ביטחון

source: Analysis Failed
he: הניתוח נכשל

source: Tap to retry
he: לחצו לניסיון נוסף

# try_again_button
source: Try Again
he: נסו שוב

# save_meal_button
source: Save Meal
he: שמור ארוחה

# saving_meal
source: Saving...
he: שומר...

source: Estimated Calories
he: קלוריות משוערות

source: cal
he: קלוריות

source: Protein
he: חלבון

source: Carbs
he: פחמימות

source: Fat
he: שומן

# grams
source: g
he: גרם

source: Ingredients
he: רכיבים

source: AI Analysis
he: ניתוח בינה מלאכותית

# analysis_error_no_internet
source: No internet connection. Please check your network and try again.
he: אין חיבור לאינטרנט. אנא בדקו את הרשת שלכם ונסו שוב.

# analysis_error_api_key
source: API configuration error. Please contact support.
he: שגיאת הגדרת API. אנא פנו לתמיכה.

# analysis_error_image_processing
source: Failed to process the image. Please try with a different photo.
he: נכשל בעיבוד התמונה. אנא נסו עם תמונה אחרת.

# analysis_error_api_request
source: Analysis service is temporarily unavailable
he: שירות הניתוח אינו זמין זמנית

# analysis_error_invalid_response
source: Received invalid response from analysis service.
he: התקבלה תגובה לא חוקית משירות הניתוח.

# analysis_error_no_food
source: No food detected in the image. Please try with a clearer food photo.
he: לא זוהה אוכל בתמונה. אנא נסו עם תמונת אוכל ברורה יותר.

# analysis_error_image_too_large
source: Image is too large. Please try with a smaller photo.
he: התמונה גדולה מדי. אנא נסו עם תמונה קטנה יותר.

# analysis_error_timeout
source: Analysis timed out. Please try again.
he: הניתוח נגב. אנא נסו שוב.

# analysis_error_rate_limit
source: Too many requests. Please wait a moment and try again.
he: יותר מדי בקשות. אנא חכו רגע ונסו שוב.

# analysis_error_unknown
source: An unexpected error occurred
he: אירעה שגיאה לא צפויה

# meal_history_section
source: Meal History
he: היסטוריית ארוחות

# view_past_analyses
source: View your past meal analyses and nutrition insights
he: צפו בניתוחי הארוחות הקודמות שלכם ותובנות תזונתיות

# meal_history_button
source: View Meal History
he: צפייה בהיסטוריית ארוחות

# view_nutrition_insights
source: Track your nutrition journey
he: עקבו אחר המסע התזונתי שלכם

# meal_history_title
source: Meal History
he: היסטוריית ארוחות

# back_button
source: Back
he: חזור

# refresh_button
source: Refresh
he: רענן

# loading_meal_history
source: Loading your meal history...
he: טוען את היסטוריית הארוחות שלכם...

# no_meals_yet
source: No meals analyzed yet
he: עדיין לא נותחו ארוחות

# start_analyzing_meals
source: Start capturing and analyzing your meals to see them here
he: התחילו לצלם ולנתח את הארוחות שלכם כדי לראות אותן כאן

# meal_tracking_benefits
source: Why track your meals?
he: למה לעקוב אחר הארוחות?

# ai_nutritional_analysis
source: Get AI-powered nutritional analysis
he: קבלו ניתוח תזונתי מבוסס בינה מלאכותית

# track_your_progress
source: Track your nutrition progress over time
he: עקבו אחר ההתקדמות התזונתית שלכם לאורך זמן

# reach_health_goals
source: Reach your health and wellness goals
he: הגיעו ליעדי הבריאות והרווחה שלכם

# failed_to_load_meals
source: Failed to load meal history
he: נכשל בטעינת היסטוריית הארוחות

source: Your Meal Journey
he: המסע התזונתי שלכם

# nutrition_insights
source: Nutrition insights from your meal history
he: תובנות תזונתיות מהיסטוריית הארוחות שלכם

source: Total Meals
he: סך הארוחות

source: Total Calories
he: סך הקלוריות

source: Avg Calories
he: ממוצע קלוריות

source: Just now
he: כרגע

# minute_ago
source: 1 minute ago
he: לפני דקה

# minutes_ago
source: %d minutes ago
he: לפני %d דקות

# hour_ago
source: 1 hour ago
he: לפני שעה

# hours_ago
source: %d hours ago
he: לפני %d שעות

# day_ago
source: 1 day ago
he: לפני יום

# days_ago
source: %d days ago
he: לפני %d ימים

# and_more
source: +more
he: +עוד
